Tekla.Structures.ModelInternal.EventHandler.lastSelectionChangeEventTime
time for last selection changed event

Tekla.Structures.ModelInternal.EventHandler.throttleSelectionChangedTimer
timer for last selection changed event

Tekla.Structures.ModelInternal.EventHandler.throttleSelectionChangedLock
lock for timed last selection changed event

Tekla.Structures.ModelInternal.EventHandler.AddListener(Tekla.Structures.Model.Events)
DO NOT USE! For internal usage only!
EventListener:

Tekla.Structures.ModelInternal.EventHandler.AddUIListener(Tekla.Structures.ModelInternal.dotClientId_t,Tekla.Structures.ModelInternal.InputGeometryEvents)
DO NOT USE! For internal usage only!
ClientID:
EventListener:

Tekla.Structures.ModelInternal.EventHandler.RemoveListener(Tekla.Structures.Model.Events)
DO NOT USE! For internal usage only!
EventListener:

Tekla.Structures.ModelInternal.EventHandler.RemoveUIListener(Tekla.Structures.ModelInternal.dotClientId_t,Tekla.Structures.ModelInternal.InputGeometryEvents)
DO NOT USE! For internal usage only!
ClientID:
EventListener:

Tekla.Structures.ModelInternal.EventHandler.OnEvent(System.String)
TS calls when event is raised.
Param: Name of the event
Returns: 1

Tekla.Structures.ModelInternal.EventHandler.OnModelObjectChangedEvent(System.String,System.Collections.Generic.List{Tekla.Structures.Model.ModelObject},System.Collections.Generic.List{Tekla.Structures.Model.ModelObject},System.Collections.Generic.List{Tekla.Structures.Model.ChangeData.ChangeTypeEnum})
sends changed objects event is raised to listeners.
Param: Name of the event
ChangedObjects: Name of the event
NumberedObjects: Name of the event
CommitTypes: Name of the event
Returns: 1

Tekla.Structures.ModelInternal.EventHandler.TimerSelectionChangedTick(System.Object,System.EventArgs)
Gets invoked if slection changed interval smaller than 100 msecs

Tekla.Structures.ModelInternal.EventHandler.GetDetectedClash(Tekla.Structures.Model.ClashCheckData)
Gets the data of the detected clash in dotClash_t struct and sets the attributes
to its ClashCheckData object parameter.

Tekla.Structures.ModelInternal.EventHandler.GetNumberOfClashes(System.Int32@)
Gets the number of clashes that have been found when the clash check has been
started from .NET API.

Tekla.Structures.ModelInternal.EventHandler.GetPointInputChangedEvent(System.Collections.Generic.List{Tekla.Structures.Model.ContourPoint}@)
Gets the latest command status change.

Tekla.Structures.ModelInternal.EventHandler.GetCommitData(Tekla.Structures.Model.ModelObject@,System.Int32@)
Gets the commit event data.